resources/TemplateToSTS.xml

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:wst="http://schemas.xmlsoap.org/ws/2005/02/trust">
	<s:Header>
		<wsa:Action s:mustUnderstand="1">http://schemas.xmlsoap.org/ws/2005/02/trust/RST/Issue</wsa:Action>
		<wsa:To s:mustUnderstand="1">https://login.microsoftonline.com/extSTS.srf</wsa:To>
		<ps:AuthInfo xmlns:ps="http://schemas.microsoft.com/LiveID/SoapServices/v1" Id="PPAuthInfo">
			<ps:BinaryVersion>5</ps:BinaryVersion>
			<ps:HostingApp>Managed IDCRL</ps:HostingApp>
		</ps:AuthInfo>
		<wsse:Security></wsse:Security>
	</s:Header>
	<s:Body>
		<wst:RequestSecurityToken xmlns:wst="http://schemas.xmlsoap.org/ws/2005/02/trust" Id="RST0">
			<wst:RequestType>http://schemas.xmlsoap.org/ws/2005/02/trust/Issue</wst:RequestType>
			<wsp:AppliesTo>
				<wsa:EndpointReference>
					<wsa:Address></wsa:Address>
				</wsa:EndpointReference>
			</wsp:AppliesTo>
			<wsp:PolicyReference URI="MBI"></wsp:PolicyReference>
		</wst:RequestSecurityToken>
	</s:Body>
</s:Envelope>